In [4]:
import pandas as pd

In [27]:
df1 = pd.DataFrame({'name':['apple','ruby','ruth'],'score':[90,80,60],'hot':[2,3,1]})
df1

    name  score  hot
0  apple     90    2
1   ruby     80    3
2   ruth     60    1

In [28]:
df2 = pd.DataFrame([{'name':'vivian','score':88},{'name':'natasha','score':77}])
df2

      name  score
0   vivian     88
1  natasha     77

In [29]:
df1[['name']]

    name
0  apple
1   ruby
2   ruth

In [30]:
df1['name']

0    apple
1     ruby
2     ruth
Name: name, dtype: object

In [31]:
df1[['name','hot']]

    name  hot
0  apple    2
1   ruby    3
2   ruth    1

In [32]:
df1[0:2]

    name  score  hot
0  apple     90    2
1   ruby     80    3

In [33]:
df1[df1['score']>75]

    name  score  hot
0  apple     90    2
1   ruby     80    3

In [34]:
df1['num']=[33,44,55]
df1

    name  score  hot  num
0  apple     90    2   33
1   ruby     80    3   44
2   ruth     60    1   55

In [36]:
df1 = df1.append(pd.DataFrame([{'name':'may','score':90,'hot':5,'num':99}])).reset_index(drop= True)
sort = False
df1

   hot   name  num  score
0    2  apple   33     90
1    3   ruby   44     80
2    1   ruth   55     60
3    5    may   99     90
4    5    may   99     90

In [41]:
df1 = df1.append(pd.DataFrame([{'name':'may','score':90,'hot':5,'num':99}])).reset_index(drop= False)
soft = True
df1

/Users/ethan/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   level_0  hot  index   name  num  score
0        0    2    0.0  apple   33     90
1        1    3    1.0   ruby   44     80
2        2    1    2.0   ruth   55     60
3        3    5    3.0    may   99     90
4        4    5    4.0    may   99     90
5        5    5    5.0    may   99     90
6        6    5    6.0    may   99     90
7        7    5    7.0    may   99     90
8        8    5    0.0    may   99     90
9        0    5    NaN    may   99     90

In [54]:
df1=df1.rename (columns ={'hot':'hito','name':'nickname'})
df1

   hito nickname  num  score
0     2    apple   33     90
1     3     ruby   44     80
2     1     ruth   55     60
3     5      may   99     90

In [55]:
df1[1:2]= pd.DataFrame([{'hito':4,'nickname':'h','num':88,'score':87}],index=[1])

In [56]:
df1

   hito nickname  num  score
0     2    apple   33     90
1     4        h   88     87
2     1     ruth   55     60
3     5      may   99     90

In [57]:
df1 = df1.drop('score',axis=1)
df1

   hito nickname  num
0     2    apple   33
1     4        h   88
2     1     ruth   55
3     5      may   99

In [58]:
df1 = df1.drop('hito',axis=1)
df1

  nickname  num
0    apple   33
1        h   88
2     ruth   55
3      may   99

In [59]:
df1 = df1.drop([1,2]).reset_index(drop=True)
df1

  nickname  num
0    apple   33
1      may   99